___


<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="Rossum"></p>

___

## Creating a Pandas Series

In [3]:
import numpy as np
import pandas as pd

### Creating a Pandas Series with Basic Format

In [4]:
ser=pd.Series([5,10,15,20,25])

In [5]:
ser

0     5
1    10
2    15
3    20
4    25
dtype: int64

### Basic Attributes of Series

In [6]:
type(ser)

pandas.core.series.Series

In [7]:
ser.dtype

dtype('int64')

In [8]:
ser.size

5

In [9]:
ser.ndim

1

In [10]:
ser.values

array([ 5, 10, 15, 20, 25], dtype=int64)

In [11]:
ser.head(3)

0     5
1    10
2    15
dtype: int64

In [12]:
ser.tail(2)

3    20
4    25
dtype: int64

### Creating Pandas Series by Using a ``list``, numpy array or ``dict``ionary

In [13]:
labels = [i for i in 'python']
my_list = list(np.arange(6))
d = dict(zip(labels,my_list))

arr = np.array([10, 20, 30,40,50,60])

### **Using Lists**

In [14]:
pd.Series(labels)

0    p
1    y
2    t
3    h
4    o
5    n
dtype: object

### **Using NumPy Arrays**

In [15]:
pd.Series(data = arr, index = labels)

p    10
y    20
t    30
h    40
o    50
n    60
dtype: int32

### **Using Dictionary**

In [16]:
pd.Series(d)

p    0
y    1
t    2
h    3
o    4
n    5
dtype: int64

In [17]:
pd.Series(data = d, index= ['q', 'o', 'y','t','k','p'])

q    NaN
o    4.0
y    1.0
t    2.0
k    NaN
p    0.0
dtype: float64

### Data in a Series

A pandas Series can hold a variety of object types:

In [18]:
#pd.Series({1,2,3,6})

In [19]:
pd.Series(set)

0    <class 'set'>
dtype: object

In [20]:
pd.Series(['pandas', 5, False, np.mean, len])

0                                   pandas
1                                        5
2                                    False
3    <function mean at 0x000001EA0E3F7F70>
4                  <built-in function len>
dtype: object

***

## Indexing Pandas Series

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look up of information.

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [21]:
ser1 = pd.Series([1,2,3,4,5],index = ['numpy', 'pandas','sql', 'gss','scipy'])

In [22]:
ser2 = pd.Series([1,2,5,4,6],index = ['numpy', 'pandas','tableau', 'seaborn','matplotlib'])

In [23]:
ser1

numpy     1
pandas    2
sql       3
gss       4
scipy     5
dtype: int64

In [24]:
ser2

numpy         1
pandas        2
tableau       5
seaborn       4
matplotlib    6
dtype: int64

In [25]:
ser1['numpy']

1

In [26]:
ser2['tableau']

5

Operations are then also done based off of index:

In [27]:
ser1 + ser2

gss           NaN
matplotlib    NaN
numpy         2.0
pandas        4.0
scipy         NaN
seaborn       NaN
sql           NaN
tableau       NaN
dtype: float64

### Indexing Examples

In [28]:
np.random.seed(101)
a = np.array(np.random.randint(5,12,6))
panser = pd.Series(a)
panser

0     8
1     6
2    11
3    10
4     8
5     6
dtype: int32

In [29]:
panser[0:2]

0    8
1    6
dtype: int32

### pandas_series[index] | pandas_series[[indices, indices...]]

In [30]:
panser = pd.Series(data = [25, 32, 35, 33], index = ["terry", "micheal", "orion", "jason"])
panser

terry      25
micheal    32
orion      35
jason      33
dtype: int64

In [31]:
panser[2]

35

In [32]:
index1 = ['terry', 'micheal', 'jason']

In [33]:
panser[index1]

terry      25
micheal    32
jason      33
dtype: int64

In [34]:
panser['terry':'orion']

terry      25
micheal    32
orion      35
dtype: int64

In [35]:
panser[0:3]

terry      25
micheal    32
orion      35
dtype: int64

### Several Selecting Attributes

In [36]:
panser.keys()

Index(['terry', 'micheal', 'orion', 'jason'], dtype='object')

In [37]:
panser.index

Index(['terry', 'micheal', 'orion', 'jason'], dtype='object')

In [38]:
panser.values

array([25, 32, 35, 33], dtype=int64)

In [39]:
panser.items()

In [40]:
list(panser.items())

[('terry', 25), ('micheal', 32), ('orion', 35), ('jason', 33)]

In [41]:
'jackson' in panser

False

In [42]:
25 in panser.values

True

In [43]:
panser['terry'] = 99

In [44]:
panser

terry      99
micheal    32
orion      35
jason      33
dtype: int64

In [45]:
panser[panser > 32]

terry    99
orion    35
jason    33
dtype: int64

DataFrames

In [46]:
data = np.arange(1,21,4)

In [47]:
pd.DataFrame(data, columns=['column1'])

   column1
0        1
1        5
2        9
3       13
4       17

In [48]:
data2 = np.arange(1,18,2).reshape(3,3)

In [49]:
df3=pd.DataFrame(data2, columns=['var1', 'var2', 'var3'])
df3

   var1  var2  var3
0     1     3     5
1     7     9    11
2    13    15    17

In [50]:
df3.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [51]:
df3.columns = ['new1', 'new2','new3']

In [52]:
df3

   new1  new2  new3
0     1     3     5
1     7     9    11
2    13    15    17

for your info:

* 1 dim --> vector 
* 2 dim --> matrix
* 3 dim --> tensor

 - ### Creating a DataFrame using a ``NumPy Arrays``

In [53]:
m=np.arange(1,50,5).reshape(5,2)
m

array([[ 1,  6],
       [11, 16],
       [21, 26],
       [31, 36],
       [41, 46]])

In [54]:
df=pd.DataFrame(m, columns=['col1','col2'])
df

   col1  col2
0     1     6
1    11    16
2    21    26
3    31    36
4    41    46

In [55]:
df.sample(2)

   col1  col2
2    21    26
1    11    16

 - ### Creating a DataFrame using a ``dict``

In [56]:
np.random.seed(101)
s1 = np.random.randint(10,18, size = 4)
s2 = np.random.randint(19,27, size = 4)
s3 = np.random.randint(28,35, size = 4)

In [57]:
myDict= {'var1':s1,'var2':s2,'var3':s3}

In [58]:
df1 = pd.DataFrame(myDict)

In [59]:
df1

   var1  var2  var3
0    17    26    29
1    13    26    33
2    11    24    28
3    16    22    32

- Simple indexing and slicing the ``DataFrames``

In [60]:
df1[1:3]

   var1  var2  var3
1    13    26    33
2    11    24    28

In [61]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [62]:
df1.index = ["a", "b", "c", "d"]

In [63]:
df1

   var1  var2  var3
a    17    26    29
b    13    26    33
c    11    24    28
d    16    22    32

In [64]:
df1['b':'d']

   var1  var2  var3
b    13    26    33
c    11    24    28
d    16    22    32

In [65]:
# we can check any column name whether it belongs to the DataFrame or not
"var2" in df1

True

In [66]:
'var5' in df1

False

### Now, let's examine again the ***idexing, selection*** and ***slicing*** methods and several ***attributes*** using a different DataFrame

In [67]:
from numpy.random import randn
np.random.seed(101)

In [68]:
# creating a DataFrame by "keyword arguments"
df3=pd.DataFrame(randn(5,4),columns='w x y z'.split(), index='a b c d e'.split())
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [69]:
df3['y']

a    0.907969
b   -0.848077
c    0.528813
d   -0.933237
e    2.605967
Name: y, dtype: float64

#### DataFrame Columns are just Series

In [70]:
df3[['y']]

          y
a  0.907969
b -0.848077
c  0.528813
d -0.933237
e  2.605967

In [71]:
# Pass a list of column names
df3[['w','y']]

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077
c -2.018168  0.528813
d  0.188695 -0.933237
e  0.190794  2.605967

In [72]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [73]:
df3['c':'e']

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

**Creating a new column:**

In [74]:
df3['w+z']=df3['w']*df3['z']
df3

          w         x         y         z       w+z
a  2.706850  0.628133  0.907969  0.503826  1.363781
b  0.651118 -0.319318 -0.848077  0.605965  0.394555
c -2.018168  0.740122  0.528813 -0.589001  1.188702
d  0.188695 -0.758872 -0.933237  0.955057  0.180215
e  0.190794  1.978757  2.605967  0.683509  0.130410

 - ### Removing Columns

In [75]:
# Not inplace unless specified!
df3.drop('w+z', axis=1, inplace=True)

In [74]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

 - ### Removing rows

In [75]:
# the default value of axis is 0 (axis = 0)
df4=df3.drop('c',axis=0)

In [76]:
df4

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

### Selecting Rows

- ### First, let's take a quick look at [`.loc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-loc.ipynb) | [`.iloc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-iloc.ipynb)

#### `.loc[]` → allows us to select data using **labels** (names) of rows (index) & columns

#### `.iloc[]` → allows us to select data using **index numbers** of rows (index) & columns. it's like classical indexing logic

In [77]:
np.random.seed(101)
m=np.random.randint(1,20, size=(5,4))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df4

   var1  var2  var3  var4
0    12    18     7    12
1    16    10    14     9
2     5     9     1    15
3     6    13     9    18
4    16     9     3    13

In [78]:
df4.loc[4]

var1    16
var2     9
var3     3
var4    13
Name: 4, dtype: int32

In [79]:
# Slicing produces the same type of the data. Here, DataFrame
df4.loc[2:4]

   var1  var2  var3  var4
2     5     9     1    15
3     6    13     9    18
4    16     9     3    13

In [80]:
df4.iloc[2:4]

   var1  var2  var3  var4
2     5     9     1    15
3     6    13     9    18

In [81]:
df4.index='a b c d e'.split()
df4

   var1  var2  var3  var4
a    12    18     7    12
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18
e    16     9     3    13

In [82]:
df4.iloc[1:4]

   var1  var2  var3  var4
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18

In [83]:
df4.loc['b':'e']

   var1  var2  var3  var4
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18
e    16     9     3    13

In [84]:
df4

   var1  var2  var3  var4
a    12    18     7    12
b    16    10    14     9
c     5     9     1    15
d     6    13     9    18
e    16     9     3    13

In [85]:
df4.loc['b':'e','var3']

b    14
c     1
d     9
e     3
Name: var3, dtype: int32

In [86]:
# how can we select these data as a DataFrame not a series
df4.loc['b':'d'][['var2']]

   var2
b    10
c     9
d    13

In [87]:
df4.iloc[2:5,2]

c    1
d    9
e    3
Name: var3, dtype: int32

In [88]:
df4.iloc[2:5][['var3']]

   var3
c     1
d     9
e     3

In [89]:
df3.loc['c']

w   -2.018168
x    0.740122
y    0.528813
z   -0.589001
Name: c, dtype: float64

In [90]:
df3.loc[['c']]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

### Selecting subset of rows and columns

 - ### `.loc[[row labels|names], [column labels|names]]`

 - ### `.iloc[[row index numbers], [column index numbers]]`

In [91]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [92]:
df3.loc['c','w']

-2.018168244037392

In [93]:
# let's select the same data as a DataFrame
df3.loc[['c'],['w']]

          w
c -2.018168

In [94]:
df3.loc[['c','e'],['w','z']]

          w         z
c -2.018168 -0.589001
e  0.190794  0.683509

In [95]:
df3.iloc[[0,2],[0,3]]

          w         z
a  2.706850  0.503826
c -2.018168 -0.589001

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [96]:
df3[df3>0.2]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d       NaN       NaN       NaN  0.955057
e       NaN  1.978757  2.605967  0.683509

In [97]:
# It returns based on rows.
df3[df3['y']<0.5]

          w         x         y         z
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [98]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [99]:
df3[df3['w']<1][['z','y']]

          z         y
b  0.605965 -0.848077
c -0.589001  0.528813
d  0.955057 -0.933237
e  0.683509  2.605967

#### For two conditions you can use **|** → `or`,  **&** →  `and` with parenthesis:

In [100]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [101]:
df3[(df3['w']>0) & (df3['z']<1)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

#### Conditional selection using ``.loc[]`` and ``.iloc[]``

In [102]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [103]:
df3.loc[(df3.y>0), ['w','z']]

          w         z
a  2.706850  0.503826
c -2.018168 -0.589001
e  0.190794  0.683509

In [104]:
df3.loc[((df3.x>1) | (df3.y<1)), ['x','w']]

          x         w
a  0.628133  2.706850
b -0.319318  0.651118
c  0.740122 -2.018168
d -0.758872  0.188695
e  1.978757  0.190794

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [105]:
df3

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [106]:
# Reset to default 0,1...n index
df3.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [107]:
df3.reset_index(drop=True)

          w         x         y         z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [108]:
newindx='CA NY WY OR CO'.split()
newindx

['CA', 'NY', 'WY', 'OR', 'CO']

In [109]:
df3['newidx']=newindx

In [110]:
df3

          w         x         y         z newidx
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     WY
d  0.188695 -0.758872 -0.933237  0.955057     OR
e  0.190794  1.978757  2.605967  0.683509     CO

In [111]:
df3.set_index('newidx',inplace=True)

In [112]:
df3

               w         x         y         z
newidx
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [113]:
# Index Levels
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

In [114]:
hier_index=pd.MultiIndex.from_tuples(multi_index)

In [115]:
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [116]:
df5=pd.DataFrame(np.random.randn(9,4), index = hier_index, columns=['A','B','C','D'])
df5

             A         B         C         D
M1 1  0.062083  0.265864 -0.095195  0.633114
   2 -0.214138  1.436661 -0.285115  0.263288
   3  1.510803  1.698778 -0.396821 -2.898352
M2 1  0.769996  0.546213  1.168932  0.988046
   2  0.987614  0.447440  1.088018 -0.601886
   3 -0.275224  1.036303 -0.280614  0.362828
M3 5 -0.025775 -0.212393  0.838518  2.197012
   6  1.590361 -0.578354  0.903319  1.543568
   7  3.014676 -0.139170  0.482311  0.977939

Now let's show how to index this! For index hierarchy we use ``df.loc[]``, if this was on the columns axis, you would just use normal bracket notation ``df[]``. Calling one level of the index returns the sub-dataframe:

In [117]:
df5.loc['M3']

          A         B         C         D
5 -0.025775 -0.212393  0.838518  2.197012
6  1.590361 -0.578354  0.903319  1.543568
7  3.014676 -0.139170  0.482311  0.977939

In [118]:
df5.loc['M2'].loc[2]

A    0.987614
B    0.447440
C    1.088018
D   -0.601886
Name: 2, dtype: float64

In [119]:
df5.loc['M2'].loc[[2]]

          A        B         C         D
2  0.987614  0.44744  1.088018 -0.601886

In [120]:
df5.index.names

FrozenList([None, None])

In [121]:
df5.index.names = ['Group','Num']

In [122]:
df5

                  A         B         C         D
Group Num
M1    1    0.062083  0.265864 -0.095195  0.633114
      2   -0.214138  1.436661 -0.285115  0.263288
      3    1.510803  1.698778 -0.396821 -2.898352
M2    1    0.769996  0.546213  1.168932  0.988046
      2    0.987614  0.447440  1.088018 -0.601886
      3   -0.275224  1.036303 -0.280614  0.362828
M3    5   -0.025775 -0.212393  0.838518  2.197012
      6    1.590361 -0.578354  0.903319  1.543568
      7    3.014676 -0.139170  0.482311  0.977939

### let's take a quick look at the [``.xs()``](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-xs.ipynb)

In [123]:
df5.xs('M3')

            A         B         C         D
Num
5   -0.025775 -0.212393  0.838518  2.197012
6    1.590361 -0.578354  0.903319  1.543568
7    3.014676 -0.139170  0.482311  0.977939

In [124]:
df5.loc['M3']

            A         B         C         D
Num
5   -0.025775 -0.212393  0.838518  2.197012
6    1.590361 -0.578354  0.903319  1.543568
7    3.014676 -0.139170  0.482311  0.977939

In [125]:
df5

                  A         B         C         D
Group Num
M1    1    0.062083  0.265864 -0.095195  0.633114
      2   -0.214138  1.436661 -0.285115  0.263288
      3    1.510803  1.698778 -0.396821 -2.898352
M2    1    0.769996  0.546213  1.168932  0.988046
      2    0.987614  0.447440  1.088018 -0.601886
      3   -0.275224  1.036303 -0.280614  0.362828
M3    5   -0.025775 -0.212393  0.838518  2.197012
      6    1.590361 -0.578354  0.903319  1.543568
      7    3.014676 -0.139170  0.482311  0.977939

In [126]:
df5.xs(['M2',2])

A    0.987614
B    0.447440
C    1.088018
D   -0.601886
Name: (M2, 2), dtype: float64

In [134]:
df5

                  A         B         C         D
Group Num
M1    1    0.062083  0.265864 -0.095195  0.633114
      2   -0.214138  1.436661 -0.285115  0.263288
      3    1.510803  1.698778 -0.396821 -2.898352
M2    1    0.769996  0.546213  1.168932  0.988046
      2    0.987614  0.447440  1.088018 -0.601886
      3   -0.275224  1.036303 -0.280614  0.362828
M3    5   -0.025775 -0.212393  0.838518  2.197012
      6    1.590361 -0.578354  0.903319  1.543568
      7    3.014676 -0.139170  0.482311  0.977939

In [135]:
df5.xs(3, level = 'Num')

              A         B         C         D
Group
M1     1.510803  1.698778 -0.396821 -2.898352
M2    -0.275224  1.036303 -0.280614  0.362828

In [128]:
df5.xs(3, level = 1)

              A         B         C         D
Group
M1     1.510803  1.698778 -0.396821 -2.898352
M2    -0.275224  1.036303 -0.280614  0.362828

In [129]:
df5.xs('A',axis=1)

Group  Num
M1     1      0.062083
       2     -0.214138
       3      1.510803
M2     1      0.769996
       2      0.987614
       3     -0.275224
M3     5     -0.025775
       6      1.590361
       7      3.014676
Name: A, dtype: float64